# 3. یک فایل متنی حاوی نام کتاب و نویسندگان آنها ایجاد کنید، سپس یک کتاب جدید را به انتهای فایل اضافه کنید.

# ایجاد و نوشتن اطلاعات کتاب‌ها و نویسندگان در فایل
with open("books.txt", "w") as file:
    file.write("کتاب اول: صد سال تنهایی - نویسنده: گابریل گارسیا مارکز\n")
    file.write("کتاب دوم: شازده کوچولو - نویسنده: آنتوان دوسنت اگزوپری\n")
    file.write("کتاب سوم: 1984 - نویسنده: جورج اورول\n")

# افزودن یک کتاب جدید به انتهای فایل
with open("books.txt", "a") as file:
    file.write("کتاب چهارم: مزرعه حیوانات - نویسنده: جورج اورول\n")
