# # روش اول

# تعریف دو set
set1 = {10, 20, 30, 40, 50}
set2 = {30, 40, 50, 60, 70}

# پیدا کردن اشتراک دو set با استفاده از متد intersection()
intersection = set1.intersection(set2)

# نمایش نتیجه
print("اشتراک دو set:", intersection)

# # روش دوم

# تعریف دو set
set1 = {10, 20, 30, 40, 50}
set2 = {30, 40, 50, 60, 70}

# پیدا کردن اشتراک دو set بااستفاده از عملگر &
intersection = set1 & set2

# نمایش نتیجه
print("اشتراک دو set:", intersection)

# --------------------------
# خروجی:
# اشتراک دو set: {50, 40, 30}
# --------------------------
