# # روش اول

# دریافت لیست از اعداد
numbers = list(map(int, input("لطفاً اعداد را با فاصله وارد کنید: ").split()))

# حذف اعداد تکراری
unique_numbers = list(set(numbers))# استفاده از متود set

# نمایش لیست جدید
print("لیست بدون اعداد تکراری:", unique_numbers)


# # روشم دوم

# دریافت لیست از اعداد
numbers = list(map(int, input("لطفاً اعداد را با فاصله وارد کنید: ").split()))

# حذف اعداد تکراری با حفظ ترتیب
unique_numbers = []
for num in numbers:
    if num not in unique_numbers:
        unique_numbers.append(num)

# نمایش لیست جدید
print("لیست بدون اعداد تکراری:", unique_numbers)


# --------------------------
# نمونه ورودی:
# لطفاً اعداد را با فاصله وارد کنید: 1 2 2 3 4 4 5 6 6 7
# --------------------------
# نمونه خروجی:
# لیست بدون اعداد تکراری: [1, 2, 3, 4, 5, 6, 7]
# --------------------------
