# شمارش تعداد اعداد مثبت وارد شده توسط کاربر تا زمانی که عدد 0 وارد کند
count = 0

while True:
    number = int(input("لطفاً یک عدد وارد کنید: "))

    if number == 0:  # اگر عدد صفر وارد شد حلقه متوقف می‌شود
        break
    elif number > 0:  # اگر عدد مثبت بود شمارش ادامه پیدا می‌کند
        count += 1

# نمایش تعداد اعداد مثبت وارد شده
print("تعداد اعداد مثبت وارد شده:", count)

# --------------------------
# خروجی:
# لطفاً یک عدد وارد کنید: 5
# لطفاً یک عدد وارد کنید: 10
# لطفاً یک عدد وارد کنید: -3
# لطفاً یک عدد وارد کنید: 0
# تعداد اعداد مثبت وارد شده: 2
# --------------------------
