# دریافت عدد از کاربر تا زمانی که عدد منفی وارد کند
while True:
    number = int(input("لطفاً یک عدد وارد کنید: "))

    if number < 0:  # اگر عدد منفی باشد حلقه متوقف می‌شود
        print("عدد منفی وارد شد. برنامه تمام شد.")
        break
    else:
        print(f"شما عدد {number} را وارد کردید.")

# --------------------------
# خروجی:
# لطفاً یک عدد وارد کنید: 5
# شما عدد 5 را وارد کردید.
# لطفاً یک عدد وارد کنید: 8
# شما عدد 8 را وارد کردید.
# لطفاً یک عدد وارد کنید: -1
# عدد منفی وارد شد. برنامه تمام شد.
# --------------------------
