# پیدا کردن و چاپ اولین 50 عدد اول
count = 0  # تعداد اعداد اول پیدا شده
num = 2  # شروع از عدد اول 2

while count < 50:
    # بررسی اینکه آیا عدد اول است
    is_prime = True
    for i in range(2, num):
        if num % i == 0:
            is_prime = False
            break
    if is_prime:
        print(num)  # چاپ عدد اول
        count += 1  # تعداد اعداد اول پیدا شده را افزایش می‌دهیم
    num += 1  # به عدد بعدی می‌رویم

# --------------------------
# خروجی:
# 2
# 3
# 5
# 7
# 11
# ...
# 229
# --------------------------
